{
    "countryName": "South Korea",
    "name": "south_korea",
    "countryFlagImage": "./img/south_korea/flag.jpg",
    "countryPatternImage": "./img/south_korea/pattern.jpg",
    "countryIntroduction": "South Korea, officially known as the Republic of Korea, is a vibrant East Asian nation known for its rich cultural heritage, modern cities, and delicious cuisine. From the bustling streets of Seoul to the serene temples of Gyeongju, South Korea offers a diverse range of experiences. Korean cuisine, including dishes like kimchi, bulgogi, and bibimbap, is renowned for its bold flavors and unique cooking techniques. Traditional Korean culture is deeply rooted in Confucianism, Buddhism, and Shamanism, with a strong emphasis on respect for elders and ancestral traditions.",
    "traditionalDishes": [
        {
            "dishName": "Kimchi",
            "dishNameInOwnLanguage": "김치",
            "dishImages": [
                "./img/south_korea/kimchi1.jpg",
                "./img/south_korea/kimchi2.jpg",
                "./img/south_korea/kimchi3.jpg"
            ],
            "dishIngredients": "Napa cabbage, Korean radishes, Garlic, Ginger, Red pepper flakes, Fish sauce, Salt",
            "dishDescription": "Kimchi is a staple of Korean cuisine, consisting of fermented vegetables, most commonly Napa cabbage and Korean radishes, seasoned with a mixture of spices and other flavorings.",
            "dishStory": "Kimchi has a history dating back thousands of years in Korea. It plays a central role in Korean culture and is served with nearly every meal. Kimchi is not only a delicious side dish but also a symbol of Korea's culinary heritage."
        },
        {
            "dishName": "Bulgogi",
            "dishNameInOwnLanguage": "불고기",
            "dishImages": [
                "./img/south_korea/bulgogi1.jpg",
                "./img/south_korea/bulgogi2.jpg",
                "./img/south_korea/bulgogi3.jpg"
            ],
            "dishIngredients": "Marinated and grilled beef, Soy sauce, Sugar, Garlic, Sesame oil, Vegetables",
            "dishDescription": "Bulgogi is a popular Korean dish featuring thinly sliced marinated beef that is grilled to perfection. It is known for its sweet and savory flavor.",
            "dishStory": "Bulgogi, which means 'fire meat,' has been enjoyed in Korea for centuries. It is often served with a variety of side dishes and is a favorite choice for family gatherings and celebrations."
        },
        {
            "dishName": "Bibimbap",
            "dishNameInOwnLanguage": "비빔밥",
            "dishImages": [
                "./img/south_korea/bibimbap1.jpg",
                "./img/south_korea/bibimbap2.jpg",
                "./img/south_korea/bibimbap3.jpg"
            ],
            "dishIngredients": "Rice, Vegetables (including kimchi), Beef or tofu, Gochujang (red chili paste), Sesame oil",
            "dishDescription": "Bibimbap is a colorful Korean dish that consists of mixed rice topped with an assortment of vegetables, meat or tofu, and a spicy sauce.",
            "dishStory": "Bibimbap translates to 'mixed rice,' and it is a popular and visually appealing dish in South Korea. It showcases the harmony of colors and flavors, and diners often enjoy mixing all the ingredients together before eating."
        },
        {
            "dishName": "Japchae",
            "dishNameInOwnLanguage": "잡채",
            "dishImages": [
                "./img/south_korea/japchae1.jpg",
                "./img/south_korea/japchae2.jpg",
                "./img/south_korea/japchae3.jpg"
            ],
            "dishIngredients": "Glass noodles, Vegetables, Soy sauce, Sesame oil, Beef or mushrooms",
            "dishDescription": "Japchae is a Korean dish featuring stir-fried glass noodles with a colorful medley of vegetables, meat, and a savory sauce.",
            "dishStory": "Japchae is a popular dish for celebrations and special occasions in South Korea. Its chewy noodles and flavorful combination of ingredients make it a delightful and festive choice."
        },
        {
            "dishName": "Tteokbokki",
            "dishNameInOwnLanguage": "떡볶이",
            "dishImages": [
                "./img/south_korea/tteokbokki1.jpg",
                "./img/south_korea/tteokbokki2.jpg",
                "./img/south_korea/tteokbokki3.jpg"
            ],
            "dishIngredients": "Rice cakes, Gochujang (red chili paste), Fish cakes, Vegetables",
            "dishDescription": "Tteokbokki is a popular Korean street food made from chewy rice cakes, fish cakes, and vegetables, all smothered in a spicy red chili paste sauce.",
            "dishStory": "Tteokbokki is a beloved snack in South Korea, especially among young people. It offers a delightful combination of textures and flavors, with a spicy kick that keeps fans coming back for more."
        },
        {
            "dishName": "Samgyeopsal",
            "dishNameInOwnLanguage": "삼겹살",
            "dishImages": [
                "./img/south_korea/samgyeopsal1.jpg",
                "./img/south_korea/samgyeopsal2.jpg",
                "./img/south_korea/samgyeopsal3.jpg"
            ],
            "dishIngredients": "Grilled pork belly, Lettuce leaves, Garlic, Soybean paste, Kimchi",
            "dishDescription": "Samgyeopsal is a popular Korean barbecue dish featuring grilled pork belly slices served with lettuce leaves and a variety of condiments.",
            "dishStory": "Samgyeopsal is a beloved dish for social gatherings in South Korea. The interactive nature of wrapping the grilled pork in lettuce leaves with flavorful accompaniments adds to the enjoyment of the meal."
        },
        {
            "dishName": "Haemul Pajeon",
            "dishNameInOwnLanguage": "해물파전",
            "dishImages": [
                "./img/south_korea/haemul_pajeon1.jpg",
                "./img/south_korea/haemul_pajeon2.jpg",
                "./img/south_korea/haemul_pajeon3.jpg"
            ],
            "dishIngredients": "Seafood (shrimp, squid, etc.), Scallions, Batter, Soy dipping sauce",
            "dishDescription": "Haemul Pajeon is a savory Korean pancake made with a variety of seafood and scallions, served with a soy-based dipping sauce.",
            "dishStory": "Haemul Pajeon is a popular dish for rainy days and gatherings with friends. Its crispy texture and seafood-rich filling make it a comforting and satisfying choice."
        },
        {
            "dishName": "Kimbap",
            "dishNameInOwnLanguage": "김밥",
            "dishImages": [
                "./img/south_korea/kimbap1.jpg",
                "./img/south_korea/kimbap2.jpg",
                "./img/south_korea/kimbap3.jpg"
            ],
            "dishIngredients": "Rice, Seaweed, Vegetables, Meat or fish, Pickled radish",
            "dishDescription": "Kimbap is a Korean dish similar to sushi, consisting of rice, vegetables, meat or fish, and pickled radish rolled in sheets of seaweed.",
            "dishStory": "Kimbap is a convenient and delicious snack or meal option in South Korea. It is often enjoyed on picnics, as a lunchbox item, or as a quick bite from street vendors."
        }
    ],
    "eatingHabits": [
        {
            "eatingHabitName": "Jeong (Deep Emotional Connection)",
            "eatingHabitDescription": "Koreans believe that food is not just nourishment but a source of emotional connection. Sharing meals is a way to strengthen bonds and express care for one another.",
            "eatingHabitReason": "Korean culture places a high value on relationships and community. Sharing food is a way to show affection and build connections."
        },
        {
            "eatingHabitName": "Anju (Drinking Snacks)",
            "eatingHabitDescription": "Anju are snacks served with alcoholic beverages, often enjoyed during social gatherings and drinking sessions.",
            "eatingHabitReason": "Anju enhances the social experience of drinking and encourages bonding among friends and colleagues."
        },
        {
            "eatingHabitName": "Kimchi with Every Meal",
            "eatingHabitDescription": "Kimchi is a staple side dish in Korean meals, accompanying almost every dish. It adds a spicy and flavorful element to the meal.",
            "eatingHabitReason": "Kimchi is not only delicious but also nutritious. It is considered essential for digestion and overall health in Korean cuisine."
        },
        {
            "eatingHabitName": "Gamsahamnida (Thank You)",
            "eatingHabitDescription": "Saying 'Gamsahamnida' before and after a meal is a way to express gratitude to the cook and show appreciation for the food.",
            "eatingHabitReason": "Gratitude and politeness are highly valued in Korean culture. Expressing thanks for a meal is a sign of respect."
        },
        {
            "eatingHabitName": "Ganjang Gejang (Soy Sauce Crab)",
            "eatingHabitDescription": "Eating fresh raw crabs marinated in soy sauce is a delicacy in South Korea. It's a flavorful and unique dining experience.",
            "eatingHabitReason": "Ganjang Gejang is considered a gourmet dish and is appreciated for its intense umami flavors. It's often enjoyed in specialized restaurants."
        },
        {
            "eatingHabitName": "Yori Jjageullae (Mixing Dishes)",
            "eatingHabitDescription": "Koreans often mix different side dishes and rice or noodles together, creating unique and flavorful combinations.",
            "eatingHabitReason": "Mixing dishes allows for a variety of flavors and textures in each bite, enhancing the overall dining experience."
        }
    ],
    "festivals": [
        {
            "festivalName": "Seollal (Lunar New Year)",
            "festivalMonth": 1,
            "festivalDate": 1,
            "festivalImage": "./img/south_korea/seollal.jpg",
            "festivalDishes": [
                {
                    "feitivalDishName": "Tteokguk",
                    "feitivalDishImage": "./img/south_korea/tteokguk.jpg",
                    "feitivalDishDescription": "Tteokguk is a traditional rice cake soup eaten to celebrate the new year and symbolizes growing one year older."
                }
            ],
            "festivalDescription": "Seollal, the Korean Lunar New Year, is a time for families to gather and pay respects to ancestors. Traditional customs include bowing to elders, playing games, and enjoying special foods like Tteokguk."
        },
        {
            "festivalName": "Daeboreum (Great Full Moon)",
            "festivalMonth": 1,
            "festivalDate": 15,
            "festivalImage": "./img/south_korea/daeboreum.jpg",
            "festivalDishes": [
                {
                    "feitivalDishName": "Bureom",
                    "feitivalDishImage": "./img/south_korea/bureom.jpg",
                    "feitivalDishDescription": "Bureom are crispy, roasted grains and nuts traditionally eaten on Daeboreum to wish for good health."
                }
            ],
            "festivalDescription": "Daeboreum is a day to celebrate the first full moon of the lunar new year. It is marked by various customs, including eating foods like Bureom for good fortune and health."
        },
        {
            "festivalName": "Lantern Festival",
            "festivalMonth": 4,
            "festivalDate": 8,
            "festivalImage": "./img/south_korea/lantern_festival.jpg",
            "festivalDishes": [
                {
                    "feitivalDishName": "Yakgwa",
                    "feitivalDishImage": "./img/south_korea/yakgwa.jpg",
                    "feitivalDishDescription": "Yakgwa is a traditional Korean sweet pastry made with honey, sesame oil, and wheat flour."
                }
            ],
            "festivalDescription": "The Lantern Festival, also known as Buddha's Birthday, is celebrated with colorful lantern displays and parades. Traditional sweets like Yakgwa are enjoyed during this joyful occasion."
        },
        {
            "festivalName": "Dano",
            "festivalMonth": 5,
            "festivalDate": 5,
            "festivalImage": "./img/south_korea/dano.jpg",
            "festivalDishes": [
                {
                    "feitivalDishName": "Surichwi",
                    "feitivalDishImage": "./img/south_korea/surichwi.jpg",
                    "feitivalDishDescription": "Surichwi are stir-fried vegetables and wild greens, enjoyed during the Dano festival to promote health and vitality."
                }
            ],
            "festivalDescription": "Dano is a traditional Korean holiday celebrated with folk games, shamanistic rituals, and special dishes like Surichwi, which are believed to bring good health and vitality."
        },
        {
            "festivalName": "Chuseok (Korean Thanksgiving)",
            "festivalMonth": 8,
            "festivalDate": 15,
            "festivalImage": "./img/south_korea/chuseok.jpg",
            "festivalDishes": [
                {
                    "feitivalDishName": "Songpyeon",
                    "feitivalDishImage": "./img/south_korea/songpyeon.jpg",
                    "feitivalDishDescription": "Songpyeon are colorful rice cakes made with various fillings, shaped like half-moons, and steamed over pine needles."
                }
            ],
            "festivalDescription": "Chuseok, also known as Korean Thanksgiving Day, is a major harvest festival celebrated with ancestral rituals, traditional games, and the sharing of delicious foods like Songpyeon rice cakes."
        },
        {
            "festivalName": "Andong Mask Dance Festival",
            "festivalMonth": 9,
            "festivalDate": 24,
            "festivalImage": "./img/south_korea/andong_mask_dance_festival.jpg",
            "festivalDishes": [
                {
                    "feitivalDishName": "Andong Jjim Dak",
                    "feitivalDishImage": "./img/south_korea/andong_jjim_dak.jpg",
                    "feitivalDishDescription": "Andong Jjim Dak is a spicy braised chicken dish traditionally enjoyed in Andong during the Mask Dance Festival."
                }
            ],
            "festivalDescription": "The Andong Mask Dance Festival showcases traditional Korean mask dance performances. Visitors can also enjoy local dishes like Andong Jjim Dak, a flavorful chicken dish."
        },
        {
            "festivalName": "Gimjang (Kimchi-Making Season)",
            "festivalMonth": 11,
            "festivalDate": 1,
            "festivalImage": "./img/south_korea/gimjang.jpg",
            "festivalDishes": [
                {
                    "feitivalDishName": "Kimchi",
                    "feitivalDishImage": "./img/south_korea/kimchi_gimjang.jpg",
                    "feitivalDishDescription": "Gimjang is a communal event where families and communities gather to make large quantities of kimchi for the winter months."
                }
            ],
            "festivalDescription": "Gimjang is a time for preparing and fermenting kimchi in large quantities to last through the winter. It is a communal event that strengthens social bonds."
        }
    ]
}